Gex-devs/miniHexa/miniHexa.ioc
#MicroXplorer Configuration settings - do not modify
CAD.formats=
CAD.pinconfig=
CAD.provider=
FREERTOS.IPParameters=Tasks01,configENABLE_FPU
FREERTOS.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
FREERTOS.configENABLE_FPU=0
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2S3.DataFormat=I2S_DATAFORMAT_24B
I2S3.ErrorAudioFreq=-0.27 %
I2S3.FullDuplexMode=I2S_FULLDUPLEXMODE_DISABLE
I2S3.IPParameters=Instance,VirtualMode,FullDuplexMode,RealAudioFreq,ErrorAudioFreq,DataFormat
I2S3.Instance=SPI$Index
I2S3.RealAudioFreq=7.978 KHz
I2S3.VirtualMode=I2S_MODE_MASTER
KeepUserPlacement=false
Mcu.CPN=STM32F401RET6
Mcu.Family=STM32F4
Mcu.IP0=CRC
Mcu.IP1=FREERTOS
Mcu.IP10=USART6
Mcu.IP2=I2C1
Mcu.IP3=I2S3
Mcu.IP4=NVIC
Mcu.IP5=RCC
Mcu.IP6=SPI1
Mcu.IP7=SYS
Mcu.IP8=USART1
Mcu.IP9=USART2
Mcu.IPNb=11
Mcu.Name=STM32F401R(D-E)Tx
Mcu.Package=LQFP64
Mcu.Pin0=PH0 - OSC_IN
Mcu.Pin1=PH1 - OSC_OUT
Mcu.Pin10=PC8
Mcu.Pin11=PC9
Mcu.Pin12=PA8
Mcu.Pin13=PA11
Mcu.Pin14=PA15
Mcu.Pin15=PC10
Mcu.Pin16=PC12
Mcu.Pin17=PB6
Mcu.Pin18=PB7
Mcu.Pin19=PB8
Mcu.Pin2=PA2
Mcu.Pin20=PB9
Mcu.Pin21=VP_CRC_VS_CRC
Mcu.Pin22=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin23=VP_SYS_VS_tim1
Mcu.Pin24=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.8.0_13.0.0
Mcu.Pin25=VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_13.0.0
Mcu.Pin26=VP_STMicroelectronics.X-CUBE-ST67W61_VS_DeviceJjApplications_1.3.0_1.3.0
Mcu.Pin27=VP_STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.3.0_1.3.0
Mcu.Pin3=PA3
Mcu.Pin4=PA5
Mcu.Pin5=PA6
Mcu.Pin6=PA7
Mcu.Pin7=PB12
Mcu.Pin8=PC6
Mcu.Pin9=PC7
Mcu.PinsNb=28
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-MEMS1.13.0.0
Mcu.ThirdParty1=STMicroelectronics.X-CUBE-ST67W61.1.3.0
Mcu.ThirdPartyNb=2
Mcu.UserConstants=
Mcu.UserName=STM32F401RETx
MxCube.Version=6.18.1
MxDb.Version=DB.6.0.181
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.EXTI9_5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.SavedPendsvIrqHandlerGenerated=true
NVIC.SavedSvcallIrqHandlerGenerated=true
NVIC.SavedSystickIrqHandlerGenerated=true
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true\:false
NVIC.TIM1_UP_TIM10_IRQn=true\:15\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TimeBase=TIM1_UP_TIM10_IRQn
NVIC.TimeBaseIP=TIM1
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PA11.GPIOParameters=GPIO_Label
PA11.GPIO_Label=USER_BUTTON
PA11.Locked=true
PA11.Signal=GPIO_Input
PA15.Locked=true
PA15.Mode=Half_Duplex_Master
PA15.Signal=I2S3_WS
PA2.GPIOParameters=GPIO_Label
PA2.GPIO_Label=UART2_LOG_TX
PA2.Mode=Asynchronous
PA2.Signal=USART2_TX
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=UART2_LOG_RX
PA3.Mode=Asynchronous
PA3.Signal=USART2_RX
PA5.Mode=Full_Duplex_Master
PA5.Signal=SPI1_SCK
PA6.Mode=Full_Duplex_Master
PA6.Signal=SPI1_MISO
PA7.Mode=Full_Duplex_Master
PA7.Signal=SPI1_MOSI
PA8.GPIOParameters=GPIO_Label
PA8.GPIO_Label=CHIP_EN
PA8.Locked=true
PA8.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label
PB12.GPIO_Label=SPI_CS
PB12.Locked=true
PB12.Signal=GPIO_Output
PB6.GPIOParameters=GPIO_Label
PB6.GPIO_Label=SERVO_TX
PB6.Locked=true
PB6.Mode=Asynchronous
PB6.Signal=USART1_TX
PB7.GPIOParameters=GPIO_Label
PB7.GPIO_Label=SERVO_RX
PB7.Locked=true
PB7.Mode=Asynchronous
PB7.Signal=USART1_RX
PB8.Mode=I2C
PB8.Signal=I2C1_SCL
PB9.Mode=I2C
PB9.Signal=I2C1_SDA
PC10.Mode=Half_Duplex_Master
PC10.Signal=I2S3_CK
PC12.Mode=Half_Duplex_Master
PC12.Signal=I2S3_SD
PC6.Locked=true
PC6.Mode=Asynchronous
PC6.Signal=USART6_TX
PC7.Locked=true
PC7.Mode=Asynchronous
PC7.Signal=USART6_RX
PC8.GPIOParameters=GPIO_Label
PC8.GPIO_Label=SPI_RDY
PC8.Locked=true
PC8.Signal=GPIO_Output
PC9.GPIOParameters=GPIO_Label
PC9.GPIO_Label=IMU_INT
PC9.Locked=true
PC9.Signal=GPXTI9
PCC.Bar.Display=Horizontal Bar
PCC.Checker=false
PCC.Display=Plot\: All Steps
PCC.Line=STM32F401
PCC.MCU=STM32F401R(D-E)Tx
PCC.PartNumber=STM32F401RETx
PCC.SequenceTime=1.0 ms
PCC.SequenceTime.Unit=ms
PCC.Series=STM32F4
PCC.Temperature=25
PCC.Vdd=3.3
PH0\ -\ OSC_IN.Mode=HSE-External-Clock-Source
PH0\ -\ OSC_IN.Signal=RCC_OSC_IN
PH1\ -\ OSC_OUT.Mode=HSE-External-Clock-Source
PH1\ -\ OSC_OUT.Signal=RCC_OSC_OUT
PinOutPanel.RotationAngle=270
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F401RETx
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.28.3
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=0
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=miniHexa.ioc
ProjectManager.ProjectName=miniHexa
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=Makefile
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_I2S3_Init-I2S3-false-HAL-true,4-MX_USART1_UART_Init-USART1-false-HAL-true,5-MX_SPI1_Init-SPI1-true-HAL-false,6-MX_USART6_UART_Init-USART6-false-HAL-true,7-MX_USART2_UART_Init-USART2-true-HAL-false,8-MX_CRC_Init-CRC-false-HAL-true
RCC.48MHZClocksFreq_Value=48000000
RCC.AHBFreq_Value=48000000
RCC.APB1CLKDivider=RCC_HCLK_DIV2
RCC.APB1Freq_Value=24000000
RCC.APB1TimFreq_Value=48000000
RCC.APB2Freq_Value=48000000
RCC.APB2TimFreq_Value=48000000
RCC.CortexFreq_Value=48000000
RCC.FCLKCortexFreq_Value=48000000
RCC.HCLKFreq_Value=48000000
RCC.HSE_VALUE=25000000
RCC.HSI_VALUE=16000000
RCC.I2SClocksFreq_Value=96000000
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLP,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VcooutputI2S
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO2PinFreq_Value=48000000
RCC.PLLCLKFreq_Value=48000000
RCC.PLLP=RCC_PLLP_DIV4
RCC.PLLQCLKFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.RTCHSEDivFreq_Value=12500000
RCC.SYSCLKFreq_VALUE=48000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.VCOI2SOutputFreq_Value=192000000
RCC.VCOInputFreq_Value=1000000
RCC.VCOOutputFreq_Value=192000000
RCC.VcooutputI2S=96000000
SH.GPXTI9.0=GPIO_EXTI9
SH.GPXTI9.ConfNb=1
SPI1.Direction=SPI_DIRECTION_2LINES
SPI1.IPParameters=VirtualType,Mode,Direction
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualType=VM_MASTER
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BSP.number=1
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjAccGyrJjLSM6DSL=I2C
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjAccGyr_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.IPParameters=SensorsJjSTM32IiMotionDIIiLibraryJjCore,BoardOoPartJjAccGyrJjLSM6DSL
STMicroelectronics.X-CUBE-MEMS1.13.0.0.SensorsJjSTM32IiMotionDIIiLibraryJjCore=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.SensorsJjSTM32IiMotionDIIiLibrary_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.condition=SEMBoardOoPartJjAccGyrJjLSM6DSLJjI2C
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.instance=I2C1
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.ip=I2C
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.name=LSM6DSL BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.solution=I2C1
STMicroelectronics.X-CUBE-MEMS1.13.0.0_SwParameter=SensorsJjSTM32IiMotionDIIiLibraryJjCore\:true;BoardOoPartJjAccGyrJjLSM6DSL\:I2C;
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ApplicationsCcDeviceJjApplication=User
STMicroelectronics.X-CUBE-ST67W61.1.3.0.BSP.number=2
STMicroelectronics.X-CUBE-ST67W61.1.3.0.DeviceJjApplications_Checked=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.IPParameters=USE_BLE,WIFI_SSID,WIFI_PASSWORD,W6X_WIFI_AUTOCONNECT,ST67W6XIiNetworkIiDriverCcNetworkJjATDriver,ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI,ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjLogging,ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjStatistics,ApplicationsCcDeviceJjApplication,ST67W6XIiNetworkIiDriverCcNetworkJjST67OoArchitecture
STMicroelectronics.X-CUBE-ST67W61.1.3.0.NetworkJjST67W6XIiNetworkIiDriver_Checked=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ST67W6XIiNetworkIiDriverCcNetworkJjATDriver=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ST67W6XIiNetworkIiDriverCcNetworkJjST67OoArchitecture=T01
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjLogging=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjStatistics=true
STMicroelectronics.X-CUBE-ST67W61.1.3.0.USE_BLE=0
STMicroelectronics.X-CUBE-ST67W61.1.3.0.W6X_WIFI_AUTOCONNECT=1
STMicroelectronics.X-CUBE-ST67W61.1.3.0.WIFI_PASSWORD=IOT@here22
STMicroelectronics.X-CUBE-ST67W61.1.3.0.WIFI_SSID=Ged-IOT
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.api=Unknown
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.component=
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.condition=
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.instance=SPI1
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.ip=SPI
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.mode=Full-Duplex Master
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.name=NCP_SPI
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.semaphore=
STMicroelectronics.X-CUBE-ST67W61.1.3.00.BSP.solution=SPI1
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.STBoard=false
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.api=Unknown
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.component=
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.condition=
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.instance=USART2
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.ip=UART|USART|LPUART
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.mode=Asynchronous
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.name=LogSh_UART
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.semaphore=
STMicroelectronics.X-CUBE-ST67W61.1.3.01.BSP.solution=USART2
STMicroelectronics.X-CUBE-ST67W61.1.3.0_SwParameter=ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjStatistics\:true;cJSONCcDataOoExchangeJjcJSON\:true;ST67W6XIiNetworkIiDriverCcNetworkJjUtilitiesJjLogging\:true;ST67W6XIiNetworkIiDriverCcNetworkJjATDriver\:true;ApplicationsCcDeviceJjApplication\:User;ST67W6XIiNetworkIiDriverCcNetworkJjST67OoArchitecture\:T01;ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI\:true;
USART1.IPParameters=VirtualMode
USART1.VirtualMode=VM_ASYNC
USART2.IPParameters=VirtualMode
USART2.VirtualMode=VM_ASYNC
USART6.IPParameters=VirtualMode
USART6.VirtualMode=VM_ASYNC
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.8.0_13.0.0.Mode=BoardOoPartJjAccGyr
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.8.0_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyr_5.8.0_13.0.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_13.0.0.Mode=SensorsJjSTM32IiMotionDIIiLibrary
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionDIIiLibrary_1.1.1_13.0.0
VP_STMicroelectronics.X-CUBE-ST67W61_VS_DeviceJjApplications_1.3.0_1.3.0.Mode=DeviceJjApplications
VP_STMicroelectronics.X-CUBE-ST67W61_VS_DeviceJjApplications_1.3.0_1.3.0.Signal=STMicroelectronics.X-CUBE-ST67W61_VS_DeviceJjApplications_1.3.0_1.3.0
VP_STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.3.0_1.3.0.Mode=NetworkJjST67W6XIiNetworkIiDriver
VP_STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.3.0_1.3.0.Signal=STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.3.0_1.3.0
VP_SYS_VS_tim1.Mode=TIM1
VP_SYS_VS_tim1.Signal=SYS_VS_tim1
board=custom
rtos.0.ip=FREERTOS
